src/Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеЗапасов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОпераций.Очистить();
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПеремещениеМеждуСкладами);
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПередачаСотруднику);
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ВозвратОтСотрудника);
	СписокОпераций.Добавить(Перечисления.ВидыОпераций.ПеремещенияМеждуСотрудниками);
	СтрЕдиницаОтбор = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	ВызовУстановкиФильтра("СтруктурнаяЕдиница", СтрЕдиницаОтбор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОБНОВИТЬ_СПИСОК_ПЕРЕМЕЩЕНИЯ_ЗАПАСОВ" Тогда
		ВызовУстановкиФильтра("СтруктурнаяЕдиница", ПолучитьСтруктурнуюЕдиницу());
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

// Функция - Получить структурную единицу
// 
&НаСервереБезКонтекста
Функция ПолучитьСтруктурнуюЕдиницу()
	Возврат(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);	
КонецФункции

&НаКлиенте
Процедура ПеремещениеМеждуСкладами(Команда)
	
	СоздатьПеремещениеЗапасов(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаСотруднику(Команда)
	
	СоздатьПеремещениеЗапасов(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратОтСотрудника(Команда)
	
	СоздатьПеремещениеЗапасов(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещенияМеждуСотрудниками(Команда)
	
	СоздатьПеремещениеЗапасов(3);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура создает новый документ "Перемещение запасов".
//
&НаКлиенте
Процедура СоздатьПеремещениеЗапасов(ИндексОперации)
	
	ВидОперации = СписокОпераций[ИндексОперации].Значение;
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, Отбор", ВидОперации, Новый Структура("Склад", СкладСотрудникОтбор)));
	// СтруктураПараметры.Вставить("Отбор", Новый Структура("Склад", СкладСотрудникОтбор));	
	ОткрытьФорму("Документ.ПеремещениеЗапасов.ФормаОбъекта", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)	
	ВызовУстановкиФильтра("СтруктурнаяЕдиница", ЭтотОбъект.СтрЕдиницаОтбор);	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ВидОперацииОтбор
//
Процедура ВидОперацииОтборПриИзменении(Элемент)	
	// ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ВидОперацииОтбор, ЗначениеЗаполнено(ВидОперацииОтбор));
	ВызовУстановкиФильтра("ВидОперации", ЭтотОбъект.ВидОперацииОтбор);	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СкладСотрудникОтбор
//
Процедура СкладСотрудникОтборПриИзменении(Элемент)	
	ВызовУстановкиФильтра("СкладПолучатель", ЭтотОбъект.СкладСотрудникОтбор);
КонецПроцедуры

&НаСервере
Процедура ВызовУстановкиФильтра(ПолеОтбор, ЗначениеОтбора)	
	
	// Документы.ПеремещениеЗапасов.УстановитьФильтр(СтрЕдиницаОтбор,ВидОперацииОтбор,СкладСотрудникОтбор,Список);	

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ЭтотОбъект.Список, ПолеОтбор, ЗначениеОтбора, ЗначениеЗаполнено(ЗначениеОтбора),,, Истина); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ПеремещениеЗапасов");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ДокументПечатьОбработкаВыбора", ЭтотОбъект, Структура);									

	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "НакладнаяНаПеремещениеПоТипуЦен" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВидЦен", ВидЦенПоУмолчаниюДляПечати());
		СтруктураПараметров.Вставить("Перемещение", "Перемещение");
		ПараметрыОповещения = Новый Структура("Результат, Параметры", Результат, Параметры);
		ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,, Новый ОписаниеОповещения("ОбработкаВыборФорматаЦены", ЭтотОбъект, ПараметрыОповещения), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
					
	Иначе
		УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(Результат, Параметры);	
	КонецЕсли;
		
КонецПроцедуры

// Функция, получается вид цен
// 
&НаСервереБезКонтекста
Функция ВидЦенПоУмолчаниюДляПечати()
	Возврат Справочники.ВидыЦен.Закупочная;
КонецФункции

// Процедура - обработчик выбора формата цены для печати накладной по типу цен
//
&НаКлиенте
Процедура ОбработкаВыборФорматаЦены(Результат, ПереданныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат = КодВозвратаДиалога.Отмена Тогда 
		
		МассивДляПараметров = Новый Массив;
		МассивДляПараметров.Добавить(ПереданныеПараметры.Параметры.МассивДокументов);
		МассивДляПараметров.Добавить(Результат.ВидЦен);	
		ПереданныеПараметры.Параметры.МассивДокументов = МассивДляПараметров;
		
		УправлениеПечатьюКлиентСтоматология.ОбработкаКоманды(ПереданныеПараметры.Результат, ПереданныеПараметры.Параметры);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция Получить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.ПеремещениеЗапасов.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаКлиенте
// Процедура - обработка команды "Создать"
//
Процедура КомандаСоздать(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("ПеремещениеМеждуСкладами", "Перемещение между складами");
	СписокКнопок.Добавить("ПередачаСотруднику", "Передача персоналу");
	СписокКнопок.Добавить("ВозвратОтСотрудника", "Возврат от персонала");
	СписокКнопок.Добавить("ПеремещенияМеждуСотрудниками", "Перемещения между персоналом");
	
	Оповещение = Новый ОписаниеОповещения("КомандаСоздатьОбработкаВыбора", ЭтотОбъект, СписокКнопок);									
	ПоказатьВыборИзМеню(Оповещение, СписокКнопок, ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик выбора при нажатии на кнопку "Создать"
//
Процедура КомандаСоздатьОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "ПеремещениеМеждуСкладами" Тогда
		ПеремещениеМеждуСкладами(Неопределено);	
		
	ИначеЕсли Результат.Значение = "ПередачаСотруднику" Тогда
		ПередачаСотруднику(Неопределено);
		
	ИначеЕсли Результат.Значение = "ВозвратОтСотрудника" Тогда
		ВозвратОтСотрудника(Неопределено);
		
	ИначеЕсли Результат.Значение = "ПеремещенияМеждуСотрудниками" Тогда		
		ПеремещенияМеждуСотрудниками(Неопределено);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
